<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>1.Overview</title><link href="anyframe.css" rel="stylesheet" type="text/css"><meta content="DocBook XSL Stylesheets V1.73.2" name="generator"><link rel="start" href="index.html" title="Anyframe Java IDE Code Generator"><link rel="up" href="pt01.html" title="I.Introduction"><link rel="prev" href="pt01.html" title="I.Introduction"><link rel="next" href="ch02.html" title="2.License"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table summary="Navigation header" width="100%"><tr><th align="center" colspan="3">1.Overview</th></tr><tr><td align="left" width="20%"><a accesskey="p" href="pt01.html">&#51060;&#51204;</a>&nbsp;</td><th align="center" width="60%">I.Introduction</th><td align="right" width="20%">&nbsp;<a accesskey="n" href="ch02.html">&#45796;&#51020;</a></td></tr></table><hr></div><div class="chapter" lang="ko"><div class="titlepage"><div><div><h2 class="title"><a name="introduction_overview"></a>1.Overview</h2></div></div></div><p>
		Anyframe&#51008; &#50724;&#54536; &#49548;&#49828; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156; Framework&#47196; &#45796;&#51020;&#44284; &#44057;&#51008; &#53945;&#51669;&#51012; &#44032;&#51648;&#44256; &#51080;&#45796;.
	</p><div class="itemizedlist"><ul type="disc"><li><p>
				<span class="bold"><strong>&#49692;&#49688; &#44061;&#52404; &#51473;&#49900;&#51032;(POJO) &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156; &#51648;&#50896;</strong></span>
				: &#54532;&#47112;&#51076;&#50892;&#53356;&#47196; &#51064;&#54644;&#49436; &#44592;&#48376; &#49444;&#44228;&#50752; &#49345;&#49464; &#49444;&#44228;&#44032; &#51060;&#51473;&#51004;&#47196; &#51652;&#54665;&#46104;&#44144;&#45208;, &#44060;&#48156; &#49884; &#49444;&#44228; &#47784;&#45944;&#51060; &#44396;&#54788;&#52404;&#50752; &#48520;&#51068;&#52824; &#46104;&#45716; &#44163;&#51012; &#51460;&#51060;&#44592; &#50948;&#54644;
				&#49692;&#49688; &#44061;&#52404; &#51473;&#49900;&#51032;(POJO) &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#51012; &#51648;&#50896;&#54620;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>Dependency Injection&#51012; &#53685;&#54620; &#51032;&#51316; &#44288;&#44228; &#52376;&#47532;</strong></span>
				: &#51064;&#53552;&#54168;&#51060;&#49828; &#51473;&#49900;&#51032; &#44060;&#48156;&#51012; &#44032;&#51060;&#46300;&#54616;&#44256; &#44061;&#52404;&#45208; &#52980;&#54252;&#45324;&#53944;&#44036;&#51032; &#52280;&#51312; &#44288;&#44228;&#45716; Dependency Injection&#51012; &#53685;&#54644; &#52376;&#47532;&#54632;&#51004;&#47196;&#50024; &#44396;&#54788;&#52404;&#51032; 
				&#48320;&#44221;&#50640; &#46384;&#47480; &#50689;&#54693;&#47141;&#51012; &#52572;&#49548;&#54868;&#54620;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>&#44060;&#48156;&#51088;&#45716; &#48708;&#51592;&#45768;&#49828; &#47196;&#51649;&#50640;&#47564; &#51665;&#51473;&#54616;&#50668; &#44396;&#54788;</strong></span>
				: &#47196;&#44613;, &#53944;&#47004;&#51117;&#49496;, &#50696;&#50808;&#52376;&#47532; &#46321;&#44284; &#44057;&#51008; &#48708;&#44592;&#45733; &#50689;&#50669;&#50640; &#45824;&#54620; &#53076;&#46300;&#44032; &#50629;&#47924; &#44592;&#45733; &#44060;&#48156; &#50689;&#50669;&#50640;&#49436; &#48516;&#47532;&#46112; &#49688; &#51080;&#46020;&#47197; &#54632;&#51004;&#47196;&#50024;, 
				&#44060;&#48156;&#51088;&#45716; &#48708;&#51592;&#45768;&#49828; &#47196;&#51649;&#50640;&#47564; &#51665;&#51473;&#54616;&#50668; &#44396;&#54788;&#54624; &#49688; &#51080;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>Singleton, Factory &#54056;&#53556; &#46321; &#50976;&#50857;&#54620; &#54056;&#53556; &#49892;&#54665; &#51648;&#50896;</strong></span>
				: &#51649;&#51217;&#51201;&#51064; &#54056;&#53556; &#44396;&#54788; &#50630;&#51060;&#46020; Singleton, Factory &#54056;&#53556; &#46321;&#51032; &#49892;&#54665;&#51012; &#51648;&#50896;&#54632;&#51004;&#47196;&#50024;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#49884; &#51064;&#49828;&#53556;&#49828;&#51032; &#49373;&#49457; &#44288;&#47532;, 
				&#45936;&#51060;&#53552; &#47924;&#44208;&#49457; &#54869;&#48372; &#46321;&#51012; &#50948;&#54644; &#50976;&#50857;&#54620; &#54056;&#53556; &#46321;&#51012; &#51649;&#51217; &#44396;&#54788;&#54616;&#45716; &#50612;&#47140;&#50880;&#51012; &#54644;&#44208;&#54644;&#51456;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>MVC Model2 &#50500;&#53412;&#53581;&#52376; &#44032;&#51060;&#46300;</strong></span>
				: Layered Architecture&#50640; &#44592;&#48152;&#54620; Java EE &#50937; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51089;&#49457;&#54624; &#46412; &#54532;&#47532;&#51232;&#53580;&#51060;&#49496; &#47196;&#51649;&#44284; &#48708;&#51648;&#45768;&#49828; &#47196;&#51649;&#51012; &#50756;&#51204;&#55176; &#48516;&#47532;&#54616;&#50668;
				&#54532;&#47532;&#51232;&#53580;&#51060;&#49496; &#47112;&#51060;&#50612;&#47484; &#44396;&#51312;&#51201;&#51004;&#47196; &#44060;&#48156;&#54624; &#49688; &#51080;&#45796;.
			</p></li></ul></div><p>
		Anyframe&#51008; &#50500;&#47000;&#50752; &#44057;&#51008; &#44592;&#45733;&#51012; &#51228;&#44277;&#54620;&#45796;.
	</p><div class="itemizedlist"><ul type="disc"><li><p>
				<span class="bold"><strong>&#50724;&#54536; &#49548;&#49828; &#53685;&#54633; &#48143; Best Practice &#51228;&#44277;&#51012; &#50948;&#54620; &#54540;&#47084;&#44536;&#51064; &#54872;&#44221; &#51228;&#44277;</strong></span>
				: &#49324;&#50857;&#51088;&#44032; &#50896;&#54616;&#45716; Plugin &#46308;&#51012; &#51201;&#51208;&#55176; &#49440;&#53469;&#54616;&#44256; &#49444;&#52824;&#54632;&#51004;&#47196;&#50024; &#54644;&#45817; &#54532;&#47196;&#51229;&#53944;&#50640; &#52572;&#51201;&#54868;&#46108; &#49368;&#54540; &#54532;&#47196;&#51229;&#53944;&#47484; &#49552;&#49789;&#44172; &#44396;&#49457;&#54624; &#49688; 
				&#51080;&#46020;&#47197; &#51648;&#50896;&#54620;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; Plugin &#44396;&#51312; &#47484; &#52280;&#44256;&#54616;&#46020;&#47197; &#54620;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>&#51116;&#49324;&#50857; &#44032;&#45733;&#54620; &#44592;&#49696; &#44277;&#53685; &#49436;&#48708;&#49828; &#51228;&#44277;</strong></span>
				: DB &#51217;&#44540; &#48143; SQL &#52376;&#47532;, &#52880;&#49772;, WAS&#50752; &#50672;&#46041; &#46321;&#44284; &#44057;&#51008; &#51473;&#50836; &#44592;&#45733;&#50640; &#45824;&#54644; &#51116;&#49324;&#50857; &#44032;&#45733;&#54620; &#44592;&#49696; &#44277;&#53685; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54632;&#51004;&#47196;&#50024; &#48372;&#45796; 
				&#48736;&#47476;&#44256; &#50504;&#51221;&#51201;&#51064; &#44060;&#48156;&#51012; &#51648;&#50896;&#54620;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>&#49440;&#50616;&#51201;&#51004;&#47196; &#53944;&#47004;&#51117;&#49496; &#53685;&#51228;</strong></span>
				: Java EE &#54872;&#44221;&#44284; &#46021;&#47549;&#51201;&#51004;&#47196; JTA&#51060;&#45208; JDBC &#45936;&#51060;&#53552; &#49548;&#49828;&#50640; &#45824;&#54644; &#48324;&#46020;&#51032; &#53944;&#47004;&#51117;&#49496; &#52376;&#47532;&#47484; &#50948;&#54620; &#53076;&#46377;&#50630;&#51060; &#44036;&#45800;&#54620; &#49444;&#51221;&#47564;&#51004;&#47196; &#49440;&#50616;&#51201;&#51004;&#47196; 
				&#53944;&#47004;&#51117;&#49496;&#51012; &#53685;&#51228;&#54624; &#49688; &#51080;&#45716; &#44592;&#45733;&#51012; &#51648;&#50896;&#54620;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>&#50937; &#54868;&#47732; &#44060;&#48156; &#49884; &#54596;&#50836;&#54620; &#44277;&#53685; &#44592;&#45733; &#51228;&#44277;</strong></span>
				: &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#50640; &#44277;&#53685;&#51201;&#51004;&#47196; &#54596;&#50836;&#54620; &#54868;&#47732;&#55120;&#47492; &#51228;&#50612;, &#50640;&#47084;&#52376;&#47532;, &#51068;&#50896;&#54868;&#46108; &#44428;&#54620;&#52376;&#47532; &#46321; &#45796;&#50577;&#54620; &#48512;&#48516;&#51012; &#54532;&#47112;&#51076;&#50892;&#53356;&#54868;&#54616;&#50668; Model2 &#48169;&#49885;&#51032;
				&#51068;&#44288;&#46104;&#44256; &#49772;&#50868; &#44060;&#48156;&#51012; &#51648;&#50896;&#54620;&#45796;.
			</p></li><li><p>
				<span class="bold"><strong>&#45796;&#50577;&#54620; &#50937; &#53364;&#46972;&#51060;&#50616;&#53944; &#44592;&#49696;&#44284; &#50857;&#51060;&#54620; &#50672;&#44228; &#44032;&#45733;</strong></span>
				: &#52572;&#44540; &#44288;&#49900;&#51060; &#45458;&#50500;&#51648;&#44256; &#51080;&#45716; Ajax, &#49345;&#50857; X-internet &#53812; &#46321; &#45796;&#50577;&#54620; &#50937; &#53364;&#46972;&#51060;&#50616;&#53944; &#44592;&#49696;&#44284; &#49789;&#44172; &#50672;&#46041;&#46104;&#45716; &#44396;&#51312;&#47484; &#51228;&#44277;&#54620;&#45796;.
			</p></li></ul></div><p>
		&#46608;&#54620; Anyframe &#44592;&#48152;&#51004;&#47196; &#54532;&#47196;&#51229;&#53944; &#49688;&#54665; &#49884;, &#44060;&#48156;&#51088;&#46308;&#51032; &#44060;&#48156; &#54200;&#51032;&#49457;&#51012; &#44537;&#45824;&#54868;&#54624; &#49688; &#51080;&#46020;&#47197; 
		<span class="bold"><strong>Anyframe &#49444;&#52824;, &#54532;&#47196;&#51229;&#53944; &#49373;&#49457; &#48143; &#53076;&#46300; &#49373;&#49457; &#44592;&#45733;&#51012; &#54252;&#54632;&#54620; Code Generator&#47484; &#51228;&#44277;</strong></span>&#54620;&#45796;. 
		Eclipse Plugin &#54805;&#53468;&#51032; Code Generator&#47484; &#53685;&#54644; 
		Anyframe &#49444;&#52824;&#50640;&#49436;&#48512;&#53552; &#54532;&#47196;&#51229;&#53944; &#44396;&#51312;, &#53076;&#46300; &#49373;&#49457;, &#48716;&#46300; &#49688;&#54665;&#50640; &#51060;&#47476;&#44592;&#44620;&#51648; &#44060;&#48156; &#54532;&#47196;&#49464;&#49828; &#51204;&#48152;&#50640; &#44152;&#52432; &#46020;&#50880;&#51012; &#48155;&#51012; &#49688; &#51080;&#45796;.
	</p></div><div class="navfooter"><hr><table summary="Navigation footer" width="100%"><tr><td align="left" width="40%"><a accesskey="p" href="pt01.html">&#51060;&#51204;</a>&nbsp;</td><td align="center" width="20%"><a accesskey="u" href="pt01.html">&#50948;&#47196;</a></td><td align="right" width="40%">&nbsp;<a accesskey="n" href="ch02.html">&#45796;&#51020;</a></td></tr><tr><td valign="top" align="left" width="40%">I.Introduction&nbsp;</td><td align="center" width="20%"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td><td valign="top" align="right" width="40%">&nbsp;2.License</td></tr></table></div></body></html>