<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>I.Introduction</title><link href="anyframe.css" rel="stylesheet" type="text/css"><meta content="DocBook XSL Stylesheets V1.73.2" name="generator"><link rel="start" href="index.html" title="Anyframe Java IDE Query Manager"><link rel="up" href="index.html" title="Anyframe Java IDE Query Manager"><link rel="prev" href="index.html" title="Anyframe Java IDE Query Manager"><link rel="next" href="ch01.html" title="1.Overview"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table summary="Navigation header" width="100%"><tr><th align="center" colspan="3">I.Introduction</th></tr><tr><td align="left" width="20%"><a accesskey="p" href="index.html">&#51060;&#51204;</a>&nbsp;</td><th align="center" width="60%">&nbsp;</th><td align="right" width="20%">&nbsp;<a accesskey="n" href="ch01.html">&#45796;&#51020;</a></td></tr></table><hr></div><div class="part" lang="ko"><div class="titlepage"><div><div><h1 class="title"><a name="Introduction"></a>I.Introduction</h1></div></div></div><div class="partintro" lang="ko"><div></div><div class="mediaobject" align="center"><img src="../image/Introduction/introduction-concept.jpg" align="middle"></div><p>
			Query Manager&#45716; &#49340;&#49457;SDS&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#54532;&#47112;&#51076;&#50892;&#53356;&#51064; Anyframe Java Core&#51032;
			Query Service&#47484; &#49324;&#50857;&#54624; &#46412; &#54596;&#50836;&#54620; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; Query&#47928;&#51012; &#44288;&#47532;&#54616;&#44256; &#54876;&#50857;&#54616;&#44592; &#49789;&#46020;&#47197; &#54644; &#51452;&#45716; Eclipse
			&#54540;&#47084;&#44536;&#51064;&#51004;&#47196;, &#45796;&#51020;&#44284; &#44057;&#51008; &#51452;&#50836; &#53945;&#51669;&#51012; &#53685;&#54644; &#44060;&#48156; &#49549;&#46020; &#48143; &#49373;&#49328;&#49457; &#54693;&#49345;&#51012; &#44592;&#45824;&#54616;&#44172; &#54644; &#51456;&#45796;.
			<div class="itemizedlist"><ul type="disc"><li><p>
						Query Explorer&#47484; &#53685;&#54644; Query ID&#51032; &#49324;&#50857;&#50668;&#48512; &#48143; &#51473;&#48373;&#50668;&#48512;&#47484; &#49789;&#44172; &#54869;&#51064; &#54624; &#49688; &#51080;&#44256;, Query
						&#47605;&#54609; XML &#54028;&#51068;&#51032; &#51204;&#52404; Outline&#51012; &#54028;&#50501; &#54624; &#49688; &#51080;&#45796; .
					</p></li><li><p>
						Query Test Editor&#47484; &#53685;&#54644; GUI&#47484; &#53685;&#54620; Query &#51089;&#49457; &#48143; &#53580;&#49828;&#53944;/&#44160;&#51613; &#48169;&#48277;&#51012; &#51228;&#44277;&#54632;&#51004;&#47196;&#50024;
						Query&#47484; &#49552;&#49789;&#44172; &#51089;&#49457;&#54624; &#49688; &#51080;&#44256;, &#51089;&#49457;&#54620; Query&#50640; &#45824;&#54620; &#52628;&#44032;&#51201;&#51064; &#53580;&#49828;&#53944; &#48708;&#50857;&#51012; &#51208;&#44048;&#49884;&#53416;&#45796;.
					</p></li><li><p>
						Query ID&#51032; &#51473;&#48373;&#50668;&#48512; &#48143; &#49324;&#50857;&#50668;&#48512;&#47484; &#44160;&#49324;&#54616;&#50668; &#51060;&#49345; &#51080;&#45716; &#48512;&#48516;&#51012; &#54868;&#47732;&#50640; &#52636;&#47141;&#54620;&#45796;. &#51316;&#51116;&#54616;&#45716; Query
						ID&#50640; &#45824;&#54644;&#49436;&#45716; &#54644;&#45817; Query&#44032; &#51316;&#51116;&#54616;&#45716; Query &#47605;&#54609; XML &#54028;&#51068;&#44284; Java &#53076;&#46300; &#44036;&#51032; &#54200;&#47532;&#54620; &#45348;&#48708;&#44172;&#51060;&#49496; &#44592;&#45733;&#51012;
						&#51228;&#44277;&#54620;&#45796;.
					</p></li><li><p>
						&#49324;&#50857;&#51088;&#51032; Eclipse &#50892;&#53356;&#49828;&#54168;&#51060;&#49828; &#45236;&#51032; &#49688;&#47566;&#51008; Query&#51032; ID&#47484; &#44160;&#49353; &#54624; &#49688; &#51080;&#44256; Query &#47605;&#54609; XML
						&#54028;&#51068;&#44284;&#51032; &#45348;&#48708;&#44172;&#51060;&#49496; &#44592;&#45733;&#51012; &#51228;&#44277;&#54616;&#50668; &#44060;&#48156; &#49373;&#49328;&#49457;&#51012; &#54693;&#49345;&#49884;&#53416;&#45796;.
					</p></li></ul></div>
			</p></div></div><div class="navfooter"><hr><table summary="Navigation footer" width="100%"><tr><td align="left" width="40%"><a accesskey="p" href="index.html">&#51060;&#51204;</a>&nbsp;</td><td align="center" width="20%">&nbsp;</td><td align="right" width="40%">&nbsp;<a accesskey="n" href="ch01.html">&#45796;&#51020;</a></td></tr><tr><td valign="top" align="left" width="40%">Anyframe Java IDE Query Manager&nbsp;</td><td align="center" width="20%"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td><td valign="top" align="right" width="40%">&nbsp;1.Overview</td></tr></table></div></body></html>